---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.NewtonMeters
source: html/9c3da8b8-77fd-b64d-bd04-f9699076a628.htm
---
# Autodesk.Revit.DB.UnitTypeId.NewtonMeters Property

Newton meters.

## Syntax (C#)
```csharp
public static ForgeTypeId NewtonMeters { get; }
```